# GradientInterpolation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Gradient..::..GradientInterpolation Property
Gradient Class See Also
---
The property labeled "Interpolation" from the "Gradient" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GradientInterpolation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GradientInterpolation As String
	Get
```

Visual C++
---
```text
public:
static property String^ GradientInterpolation {
	String^ get ();
}
```

# Remarks
This property is a "AssetPropertyList" of type "AssetPropertyInteger".
# See Also
Gradient Class
Autodesk.Revit.DB.Visual Namespace